# Configurating a switch management address
### Part 1: Configure a basic network device
#### Cable the network as shown in the topology
<img src="topology.png" alt="IMAGE ALT TEXT HERE"    />

#### Configure basic switch settings including host name, management address and Telnet access

> Image below show the configuration of the SVI (Switch virtual Interface)
<img src="set-svi-ip-address.png" alt="IMAGE ALT TEXT HERE"   border="1" />
<br> 
Image below show the setup of password for restricted access on the swtich console.
<img src="password.png" alt="IMAGE ALT TEXT HERE" border="1" />
<br>
The image below shows the steps in order to configure the virtual terminal(VTY) line for 
the switch to allow Telnet access. (If you do not configure a VTY password
, you will not be able to Telnet to the switch.)
<img src="telnet-password.png" alt="IMAGE ALT TEXT HERE" border="1" />
 
#### Configure an IP adress on the PC

### Part 2: Verify and test network connectivity
#### Display device configuration

> S1 # **show run** <br>
..................... <br>
> S1 # **show ip interface brief**

#### Test end-to-end connectivity with ping
> Testing end-to-end connection with the ping command in the cmd prompt 
<img src="ping-switch.png" alt="IMAGE ALT TEXT HERE" border="1" />
<br>

#### Test remote capability with Telnet.
> Example of how to issue a telnet command from the cmd prompt.
> <img src="telnet-connect.png" alt="IMAGE ALT TEXT HERE" border="1" />

#### Save the switch running confguration file
> Example of how to save the config file in a telnet session.
> <img src="telnet-save-config.png" alt="IMAGE ALT TEXT HERE" border="1" />

# Q&A
<blockquote style="background-color:yellow">
What is the purpose of this command:<br>
S1(config)# **line con 0**
</blockquote>

<blockquote style="background-color:yellow">
<p style="color:red">The quit command did not work in the cmd prompt during the telnet session.</p>
<img src="quit-error.png" alt="IMAGE ALT TEXT HERE" border="1" />
</blockquote>
 