# Building a simple network
## Part 1:Set up the network technology(Ethernet only) 
- **Identify calbles and ports for use in the network.**
- **Cable a physical lab topology.**

<img src="network-topology.png" alt="IMAGE ALT TEXT HERE" width="95%"  border="1" />

## Part 2:Configure PC Hosts 
- **Enter static IP adress information on the LAN interface of the hosts.**
- **Verify that PCs can communicate using the ping utility.**

<img src="ping-pcb.png" alt="IMAGE ALT TEXT HERE" width="95%"  border="1" />

## Part 3: Configure and verify basic switch settings
- **Configure each switch with host names, local password and login banner.**
    - S1 is connected to PCA trought the console port on the switch and
    the serial port on PCA. The image below shows the terminal
    on PCA(Simulation of terra term in cisco packet tracer).
<br>

<img src="terminal-pca.png" alt="IMAGE ALT TEXT HERE" width="95%"  border="1" />

- **Save the running configuration.**
    - Use the **copy** command to save device configuration.
- **Display the running configuration.**
    - Use the **show** command to display the running configuration.
- **Display the IOS(Internetwork Operating System) version for the running switch.**
    - Use the **show** command to display the IOS version.
- **Display the status of the interfaces.**
    - Use the **show** command to display the interface status.  

Below is an example of how to setup the switch with, hostname, password, login banner etc.
> switch> enable
<br>
> switch# 
<br>
> switch# **configure terminal** 
<br>
> switch# **hostname S1**
<br>
> switch# **no ip domain-lookup**
<br>
> switch# **enable secret class**    (The password is set to class in order to enable exec mode)
<br>
> switch# **line con 0**
<br>
> switch# **password cisco** ( The password to enter the switch terminal is set to cisco)
<br>
> switch# **login**
<br>
> switch# **exit**
<br>
> switch# **banner motd #**
<br>
Enter text message. Terminate with #
<br>
> switch# **Unautorized access is strictly prohibited to the full extent of the law. #** 
<br>
> switch# **exit**
<br>
> switch# **copy running-config startup-config**
<br>
> switch# **show running-config**
<br>
<img src="show-running-config-1.png" alt="IMAGE ALT TEXT HERE" border="1" />
<img src="show-running-config-2.png" alt="IMAGE ALT TEXT HERE" border="1" />

> switch# **show version**
<img src="show-version.png" alt="IMAGE ALT TEXT HERE" border="1" />
<br>

> switch# **show ip interface brief**
<img src="show-version.png" alt="IMAGE ALT TEXT HERE" border="1" />
<br>

> switch# **show flash**
<img src="show-flash.png" alt="IMAGE ALT TEXT HERE" border="1" />
<br>

> There was no vlan file on this virtual switch so I could not delete it.
<br>
> switch# **delete vlan.dat**
<img src="delete-vlan.png" alt="IMAGE ALT TEXT HERE" border="1" />
<br>

> switch# **erase startup-config**
<img src="erase-startup-config.png" alt="IMAGE ALT TEXT HERE" border="1" />
<br>
> switch# **reload** (This command reloads the switch)
<img src="reload-1.png" alt="IMAGE ALT TEXT HERE" border="1" />
<img src="reload-2.png" alt="IMAGE ALT TEXT HERE" border="1" />

- **Did not receive the promp(would you like to enter the initial configuration...)
 when the switch was reloaded**.


